app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 6 AND "order_items"."product_id" IS NULL LIMIT 1
UPDATE "order_items" SET "quantity" = 1, "updated_at" = '2012-11-01 16:55:15.040905' WHERE "order_items"."id" = 39
---
 def create
    @order_item = @order.order_items.find_or_initialize_by_product_id(params[:product_id])
    unless @order_item.new_record?
        @order_item.quantity += 1
    end

    if @order_item.save

SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT 1  [["id", "36"]]
---
  def edit
    @order_item = OrderItem.find(params[:id])

SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT 1  [["id", "36"]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 38]]
UPDATE "order_items" SET "quantity" = 2, "updated_at" = '2012-11-01 15:27:49.203616' WHERE "order_items"."id" = 36
---
   def update
      @order_item = OrderItem.find(params[:id])
      if params[:order_item][:quantity].to_i == 0
        @order_item.destroy
        redirect_to @order, :notice  => "Item was removed"
      elsif
        @order_item.update_attributes(params[:order_item])