app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])
    if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "price", "stock", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "products" SET "description" = '(1)Bag of 6 Valencia oranges.', "updated_at" = '2012-10-30 21:35:18.918571' WHERE "products"."id" = 7